# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою.
# Наприклад: [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

def print_sum_from_tuple(tpl):
    for item in tpl:
        sum_ = 0
        try:
            lst = item.split(',')
            for i in lst:
                sum_ += int(i)
        except ValueError:
            print("Не можу це зробити!")
        else:
            print(sum_)

tuple_ = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]
print_sum_from_tuple(tuple_)
